# Kubernetes tools
brew "kubernetes-cli"
brew "helm"
brew "argocd"
brew "krew"
brew "kubectx"
brew "kubecolor"
brew "k9s"
brew "istioctl"

# AWS tools
brew "awscli"
brew "aws-vault"

# Azure tools
brew "azure-cli"
brew "azcopy"

# Infrastructure as Code
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "terrascan"
brew "packer-completion"

# Container tools
brew "docker"
brew "colima"
brew "cosign"
brew "ctop"
brew "dive"

# Shell utilities
brew "zsh"
brew "powerlevel10k"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "vim"
brew "neovim"

# Development tools
brew "git"
brew "asdf"
brew "pre-commit"

# Database tools
brew "mysql-client"
brew "redis"
brew "sqlcmd"

# File & text utilities
brew "coreutils"
brew "jq"
brew "parallel"
brew "tree"
brew "wget"

# Applications
cask "iterm2"
cask "visual-studio-code"
cask "caffeine"
cask "clipy"
cask "mac-mouse-fix"
cask "rectangle"